app/controllers/books_controller.rb

  def create
    @book = current_user.books.build(book_params)
    if @book.save
---
INSERT INTO "books" ("user_id", "title", "author", "total_pages", "target_pages", "current_page", "deadline", "status", "extension_count", "completed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def destroy
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]

  def set_book
    @book = current_user.books.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = $1 AND "books"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]